{"class_name": "Model", "config": {"name": "model_24", "layers": [{"name": "userID", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "userID"}, "inbound_nodes": []}, {"name": "users_mean_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "users_mean_rating"}, "inbound_nodes": []}, {"name": "user_reviewcount", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "user_reviewcount"}, "inbound_nodes": []}, {"name": "locationId", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "locationId"}, "inbound_nodes": []}, {"name": "createdDate", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "createdDate"}, "inbound_nodes": []}, {"name": "photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "photonum"}, "inbound_nodes": []}, {"name": "fch", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "fch"}, "inbound_nodes": []}, {"name": "category_l", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "category_l"}, "inbound_nodes": []}, {"name": "rated_count", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "rated_count"}, "inbound_nodes": []}, {"name": "average_photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_photonum"}, "inbound_nodes": []}, {"name": "average_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_rating"}, "inbound_nodes": []}, {"name": "FM_userID", "class_name": "Embedding", "config": {"name": "FM_userID", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 57332, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["userID", 0, 0, {}]]]}, {"name": "FM_users_mean_rating", "class_name": "Embedding", "config": {"name": "FM_users_mean_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 4893, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["users_mean_rating", 0, 0, {}]]]}, {"name": "FM_user_reviewcount", "class_name": "Embedding", "config": {"name": "FM_user_reviewcount", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 73, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["user_reviewcount", 0, 0, {}]]]}, {"name": "FM_locationId", "class_name": "Embedding", "config": {"name": "FM_locationId", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 3180, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["locationId", 0, 0, {}]]]}, {"name": "FM_createdDate", "class_name": "Embedding", "config": {"name": "FM_createdDate", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 4213, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["createdDate", 0, 0, {}]]]}, {"name": "FM_photonum", "class_name": "Embedding", "config": {"name": "FM_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 38, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["photonum", 0, 0, {}]]]}, {"name": "FM_fch", "class_name": "Embedding", "config": {"name": "FM_fch", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 3, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["fch", 0, 0, {}]]]}, {"name": "FM_category_l", "class_name": "Embedding", "config": {"name": "FM_category_l", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["category_l", 0, 0, {}]]]}, {"name": "FM_rated_count", "class_name": "Embedding", "config": {"name": "FM_rated_count", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 174, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["rated_count", 0, 0, {}]]]}, {"name": "FM_average_photonum", "class_name": "Embedding", "config": {"name": "FM_average_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 672, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_photonum", 0, 0, {}]]]}, {"name": "FM_average_rating", "class_name": "Embedding", "config": {"name": "FM_average_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 623, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_rating", 0, 0, {}]]]}, {"name": "flatten_68", "class_name": "Flatten", "config": {"name": "flatten_68", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_userID", 0, 0, {}]]]}, {"name": "flatten_69", "class_name": "Flatten", "config": {"name": "flatten_69", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_users_mean_rating", 0, 0, {}]]]}, {"name": "flatten_70", "class_name": "Flatten", "config": {"name": "flatten_70", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_user_reviewcount", 0, 0, {}]]]}, {"name": "flatten_71", "class_name": "Flatten", "config": {"name": "flatten_71", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_locationId", 0, 0, {}]]]}, {"name": "flatten_72", "class_name": "Flatten", "config": {"name": "flatten_72", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_createdDate", 0, 0, {}]]]}, {"name": "flatten_73", "class_name": "Flatten", "config": {"name": "flatten_73", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_photonum", 0, 0, {}]]]}, {"name": "flatten_74", "class_name": "Flatten", "config": {"name": "flatten_74", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_fch", 0, 0, {}]]]}, {"name": "flatten_75", "class_name": "Flatten", "config": {"name": "flatten_75", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_category_l", 0, 0, {}]]]}, {"name": "flatten_76", "class_name": "Flatten", "config": {"name": "flatten_76", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_rated_count", 0, 0, {}]]]}, {"name": "flatten_77", "class_name": "Flatten", "config": {"name": "flatten_77", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_photonum", 0, 0, {}]]]}, {"name": "flatten_78", "class_name": "Flatten", "config": {"name": "flatten_78", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_rating", 0, 0, {}]]]}, {"name": "lambda_65", "class_name": "Lambda", "config": {"name": "lambda_65", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_68", 0, 0, {}]]]}, {"name": "lambda_66", "class_name": "Lambda", "config": {"name": "lambda_66", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_69", 0, 0, {}]]]}, {"name": "lambda_67", "class_name": "Lambda", "config": {"name": "lambda_67", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_70", 0, 0, {}]]]}, {"name": "lambda_68", "class_name": "Lambda", "config": {"name": "lambda_68", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_71", 0, 0, {}]]]}, {"name": "lambda_69", "class_name": "Lambda", "config": {"name": "lambda_69", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_72", 0, 0, {}]]]}, {"name": "lambda_70", "class_name": "Lambda", "config": {"name": "lambda_70", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_73", 0, 0, {}]]]}, {"name": "lambda_71", "class_name": "Lambda", "config": {"name": "lambda_71", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_74", 0, 0, {}]]]}, {"name": "lambda_72", "class_name": "Lambda", "config": {"name": "lambda_72", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_75", 0, 0, {}]]]}, {"name": "lambda_73", "class_name": "Lambda", "config": {"name": "lambda_73", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_76", 0, 0, {}]]]}, {"name": "lambda_74", "class_name": "Lambda", "config": {"name": "lambda_74", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_77", 0, 0, {}]]]}, {"name": "lambda_75", "class_name": "Lambda", "config": {"name": "lambda_75", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_78", 0, 0, {}]]]}, {"name": "concatenate_12", "class_name": "Concatenate", "config": {"name": "concatenate_12", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lambda_65", 0, 0, {}], ["lambda_66", 0, 0, {}], ["lambda_67", 0, 0, {}], ["lambda_68", 0, 0, {}], ["lambda_69", 0, 0, {}], ["lambda_70", 0, 0, {}], ["lambda_71", 0, 0, {}], ["lambda_72", 0, 0, {}], ["lambda_73", 0, 0, {}], ["lambda_74", 0, 0, {}], ["lambda_75", 0, 0, {}]]]}, {"name": "flatten_80", "class_name": "Flatten", "config": {"name": "flatten_80", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_12", 0, 0, {}]]]}, {"name": "layer0", "class_name": "Dense", "config": {"name": "layer0", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_80", 0, 0, {}]]]}, {"name": "lambda_76", "class_name": "Lambda", "config": {"name": "lambda_76", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAADQAAAAsAAABDAAAAc9IAAAB8AFwLfQF9An0DfQR9BX0GfQd9CH0JfQp9C3QAagF8\nAXwCZwJkAWQCjQJ9DHQAagF8DHwDZwJkAWQCjQJ9DHQAagF8DHwEZwJkAWQCjQJ9DHQAagF8DHwF\nZwJkAWQCjQJ9DHQAagF8DHwGZwJkAWQCjQJ9DHQAagF8DHwHZwJkAWQCjQJ9DHQAagF8DHwIZwJk\nAWQCjQJ9DHQAagF8DHwJZwJkAWQCjQJ9DHQAagF8DHwKZwJkAWQCjQJ9DHQAagF8DHwLZwJkAWQC\njQJ9DHwMUwApA07pAgAAACkB2gRheGlzKQLaAnRm2gZjb25jYXQpDdoFdmVjdHPaAmEx2gJhMtoC\nYTPaAmE02gJhNdoCYTbaAmE32gJhONoCYTnaA2ExMNoDYTEx2gF6qQByEgAAAPogPGlweXRob24t\naW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aDmNvbmNhdF9zaGFwZTJEBQAAAHMYAAAAAAEaARIBEgES\nARIBEgESARIBEgESARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_65", 0, 0, {}], ["lambda_66", 0, 0, {}], ["lambda_67", 0, 0, {}], ["lambda_68", 0, 0, {}], ["lambda_69", 0, 0, {}], ["lambda_70", 0, 0, {}], ["lambda_71", 0, 0, {}], ["lambda_72", 0, 0, {}], ["lambda_73", 0, 0, {}], ["lambda_74", 0, 0, {}], ["lambda_75", 0, 0, {}]]]}, {"name": "layer1", "class_name": "Dense", "config": {"name": "layer1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer0", 0, 0, {}]]]}, {"name": "conv1d_4", "class_name": "Conv1D", "config": {"name": "conv1d_4", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_76", 0, 0, {}]]]}, {"name": "concatenate_13", "class_name": "Concatenate", "config": {"name": "concatenate_13", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_80", 0, 0, {}], ["layer1", 0, 0, {}]]]}, {"name": "flatten_79", "class_name": "Flatten", "config": {"name": "flatten_79", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]]}, {"name": "concatenate_14", "class_name": "Concatenate", "config": {"name": "concatenate_14", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_79", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_14", 0, 0, {}]]]}, {"name": "prediction", "class_name": "Dense", "config": {"name": "prediction", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}], "input_layers": [["userID", 0, 0], ["users_mean_rating", 0, 0], ["user_reviewcount", 0, 0], ["locationId", 0, 0], ["createdDate", 0, 0], ["photonum", 0, 0], ["fch", 0, 0], ["category_l", 0, 0], ["rated_count", 0, 0], ["average_photonum", 0, 0], ["average_rating", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}