{"class_name": "Model", "config": {"name": "model_5", "layers": [{"name": "userID", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "userID"}, "inbound_nodes": []}, {"name": "users_mean_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "users_mean_rating"}, "inbound_nodes": []}, {"name": "user_reviewcount", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "user_reviewcount"}, "inbound_nodes": []}, {"name": "locationId", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "locationId"}, "inbound_nodes": []}, {"name": "createdDate", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "createdDate"}, "inbound_nodes": []}, {"name": "photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "photonum"}, "inbound_nodes": []}, {"name": "fch", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "fch"}, "inbound_nodes": []}, {"name": "category_l", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "category_l"}, "inbound_nodes": []}, {"name": "rated_count", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "rated_count"}, "inbound_nodes": []}, {"name": "average_photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_photonum"}, "inbound_nodes": []}, {"name": "average_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_rating"}, "inbound_nodes": []}, {"name": "FM_userID", "class_name": "Embedding", "config": {"name": "FM_userID", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 48502, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["userID", 0, 0, {}]]]}, {"name": "FM_users_mean_rating", "class_name": "Embedding", "config": {"name": "FM_users_mean_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 4884, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["users_mean_rating", 0, 0, {}]]]}, {"name": "FM_user_reviewcount", "class_name": "Embedding", "config": {"name": "FM_user_reviewcount", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 73, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["user_reviewcount", 0, 0, {}]]]}, {"name": "FM_locationId", "class_name": "Embedding", "config": {"name": "FM_locationId", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1270, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["locationId", 0, 0, {}]]]}, {"name": "FM_createdDate", "class_name": "Embedding", "config": {"name": "FM_createdDate", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 4196, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["createdDate", 0, 0, {}]]]}, {"name": "FM_photonum", "class_name": "Embedding", "config": {"name": "FM_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 31, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["photonum", 0, 0, {}]]]}, {"name": "FM_fch", "class_name": "Embedding", "config": {"name": "FM_fch", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["fch", 0, 0, {}]]]}, {"name": "FM_category_l", "class_name": "Embedding", "config": {"name": "FM_category_l", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["category_l", 0, 0, {}]]]}, {"name": "FM_rated_count", "class_name": "Embedding", "config": {"name": "FM_rated_count", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 141, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["rated_count", 0, 0, {}]]]}, {"name": "FM_average_photonum", "class_name": "Embedding", "config": {"name": "FM_average_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 392, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_photonum", 0, 0, {}]]]}, {"name": "FM_average_rating", "class_name": "Embedding", "config": {"name": "FM_average_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 345, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_rating", 0, 0, {}]]]}, {"name": "flatten_27", "class_name": "Flatten", "config": {"name": "flatten_27", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_userID", 0, 0, {}]]]}, {"name": "flatten_28", "class_name": "Flatten", "config": {"name": "flatten_28", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_users_mean_rating", 0, 0, {}]]]}, {"name": "flatten_29", "class_name": "Flatten", "config": {"name": "flatten_29", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_user_reviewcount", 0, 0, {}]]]}, {"name": "flatten_30", "class_name": "Flatten", "config": {"name": "flatten_30", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_locationId", 0, 0, {}]]]}, {"name": "flatten_31", "class_name": "Flatten", "config": {"name": "flatten_31", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_createdDate", 0, 0, {}]]]}, {"name": "flatten_32", "class_name": "Flatten", "config": {"name": "flatten_32", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_photonum", 0, 0, {}]]]}, {"name": "flatten_33", "class_name": "Flatten", "config": {"name": "flatten_33", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_fch", 0, 0, {}]]]}, {"name": "flatten_34", "class_name": "Flatten", "config": {"name": "flatten_34", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_category_l", 0, 0, {}]]]}, {"name": "flatten_35", "class_name": "Flatten", "config": {"name": "flatten_35", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_rated_count", 0, 0, {}]]]}, {"name": "flatten_36", "class_name": "Flatten", "config": {"name": "flatten_36", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_photonum", 0, 0, {}]]]}, {"name": "flatten_37", "class_name": "Flatten", "config": {"name": "flatten_37", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_rating", 0, 0, {}]]]}, {"name": "lambda_25", "class_name": "Lambda", "config": {"name": "lambda_25", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_27", 0, 0, {}]]]}, {"name": "lambda_26", "class_name": "Lambda", "config": {"name": "lambda_26", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_28", 0, 0, {}]]]}, {"name": "lambda_27", "class_name": "Lambda", "config": {"name": "lambda_27", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_29", 0, 0, {}]]]}, {"name": "lambda_28", "class_name": "Lambda", "config": {"name": "lambda_28", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_30", 0, 0, {}]]]}, {"name": "lambda_29", "class_name": "Lambda", "config": {"name": "lambda_29", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_31", 0, 0, {}]]]}, {"name": "lambda_30", "class_name": "Lambda", "config": {"name": "lambda_30", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_32", 0, 0, {}]]]}, {"name": "lambda_31", "class_name": "Lambda", "config": {"name": "lambda_31", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_33", 0, 0, {}]]]}, {"name": "lambda_32", "class_name": "Lambda", "config": {"name": "lambda_32", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_34", 0, 0, {}]]]}, {"name": "lambda_33", "class_name": "Lambda", "config": {"name": "lambda_33", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_35", 0, 0, {}]]]}, {"name": "lambda_34", "class_name": "Lambda", "config": {"name": "lambda_34", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_36", 0, 0, {}]]]}, {"name": "lambda_35", "class_name": "Lambda", "config": {"name": "lambda_35", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPoePGlweXRo\nb24taW5wdXQtNS0wMDI4MDFiNGYwOWE+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_37", 0, 0, {}]]]}, {"name": "concatenate_7", "class_name": "Concatenate", "config": {"name": "concatenate_7", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lambda_25", 0, 0, {}], ["lambda_26", 0, 0, {}], ["lambda_27", 0, 0, {}], ["lambda_28", 0, 0, {}], ["lambda_29", 0, 0, {}], ["lambda_30", 0, 0, {}], ["lambda_31", 0, 0, {}], ["lambda_32", 0, 0, {}], ["lambda_33", 0, 0, {}], ["lambda_34", 0, 0, {}], ["lambda_35", 0, 0, {}]]]}, {"name": "flatten_39", "class_name": "Flatten", "config": {"name": "flatten_39", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]]}, {"name": "layer0", "class_name": "Dense", "config": {"name": "layer0", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_39", 0, 0, {}]]]}, {"name": "lambda_36", "class_name": "Lambda", "config": {"name": "lambda_36", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAADQAAAAsAAABDAAAAc9IAAAB8AFwLfQF9An0DfQR9BX0GfQd9CH0JfQp9C3QAagF8\nAXwCZwJkAWQCjQJ9DHQAagF8DHwDZwJkAWQCjQJ9DHQAagF8DHwEZwJkAWQCjQJ9DHQAagF8DHwF\nZwJkAWQCjQJ9DHQAagF8DHwGZwJkAWQCjQJ9DHQAagF8DHwHZwJkAWQCjQJ9DHQAagF8DHwIZwJk\nAWQCjQJ9DHQAagF8DHwJZwJkAWQCjQJ9DHQAagF8DHwKZwJkAWQCjQJ9DHQAagF8DHwLZwJkAWQC\njQJ9DHwMUwApA07pAgAAACkB2gRheGlzKQLaAnRm2gZjb25jYXQpDdoFdmVjdHPaAmEx2gJhMtoC\nYTPaAmE02gJhNdoCYTbaAmE32gJhONoCYTnaA2ExMNoDYTEx2gF6qQByEgAAAPoePGlweXRob24t\naW5wdXQtNS0wMDI4MDFiNGYwOWE+2g5jb25jYXRfc2hhcGUyRAUAAABzGAAAAAABGgESARIBEgES\nARIBEgESARIBEgESAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_25", 0, 0, {}], ["lambda_26", 0, 0, {}], ["lambda_27", 0, 0, {}], ["lambda_28", 0, 0, {}], ["lambda_29", 0, 0, {}], ["lambda_30", 0, 0, {}], ["lambda_31", 0, 0, {}], ["lambda_32", 0, 0, {}], ["lambda_33", 0, 0, {}], ["lambda_34", 0, 0, {}], ["lambda_35", 0, 0, {}]]]}, {"name": "layer1", "class_name": "Dense", "config": {"name": "layer1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer0", 0, 0, {}]]]}, {"name": "conv1d_3", "class_name": "Conv1D", "config": {"name": "conv1d_3", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_36", 0, 0, {}]]]}, {"name": "concatenate_8", "class_name": "Concatenate", "config": {"name": "concatenate_8", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_39", 0, 0, {}], ["layer1", 0, 0, {}]]]}, {"name": "flatten_38", "class_name": "Flatten", "config": {"name": "flatten_38", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"name": "concatenate_9", "class_name": "Concatenate", "config": {"name": "concatenate_9", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_38", 0, 0, {}], ["dense_3", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"name": "prediction", "class_name": "Dense", "config": {"name": "prediction", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}], "input_layers": [["userID", 0, 0], ["users_mean_rating", 0, 0], ["user_reviewcount", 0, 0], ["locationId", 0, 0], ["createdDate", 0, 0], ["photonum", 0, 0], ["fch", 0, 0], ["category_l", 0, 0], ["rated_count", 0, 0], ["average_photonum", 0, 0], ["average_rating", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}