{"class_name": "Model", "config": {"name": "model_26", "layers": [{"name": "userID", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "userID"}, "inbound_nodes": []}, {"name": "users_mean_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "users_mean_rating"}, "inbound_nodes": []}, {"name": "user_reviewcount", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "user_reviewcount"}, "inbound_nodes": []}, {"name": "locationId", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "locationId"}, "inbound_nodes": []}, {"name": "createdDate", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "createdDate"}, "inbound_nodes": []}, {"name": "photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "photonum"}, "inbound_nodes": []}, {"name": "fch", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "fch"}, "inbound_nodes": []}, {"name": "category_l", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "category_l"}, "inbound_nodes": []}, {"name": "rated_count", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "rated_count"}, "inbound_nodes": []}, {"name": "average_photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_photonum"}, "inbound_nodes": []}, {"name": "average_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_rating"}, "inbound_nodes": []}, {"name": "FM_userID", "class_name": "Embedding", "config": {"name": "FM_userID", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 72543, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["userID", 0, 0, {}]]]}, {"name": "FM_users_mean_rating", "class_name": "Embedding", "config": {"name": "FM_users_mean_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 34424, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["users_mean_rating", 0, 0, {}]]]}, {"name": "FM_user_reviewcount", "class_name": "Embedding", "config": {"name": "FM_user_reviewcount", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 174, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["user_reviewcount", 0, 0, {}]]]}, {"name": "FM_locationId", "class_name": "Embedding", "config": {"name": "FM_locationId", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 15934, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["locationId", 0, 0, {}]]]}, {"name": "FM_createdDate", "class_name": "Embedding", "config": {"name": "FM_createdDate", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 3487, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["createdDate", 0, 0, {}]]]}, {"name": "FM_photonum", "class_name": "Embedding", "config": {"name": "FM_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 52, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["photonum", 0, 0, {}]]]}, {"name": "FM_fch", "class_name": "Embedding", "config": {"name": "FM_fch", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 3, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["fch", 0, 0, {}]]]}, {"name": "FM_category_l", "class_name": "Embedding", "config": {"name": "FM_category_l", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 2, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["category_l", 0, 0, {}]]]}, {"name": "FM_rated_count", "class_name": "Embedding", "config": {"name": "FM_rated_count", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 311, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["rated_count", 0, 0, {}]]]}, {"name": "FM_average_photonum", "class_name": "Embedding", "config": {"name": "FM_average_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1943, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_photonum", 0, 0, {}]]]}, {"name": "FM_average_rating", "class_name": "Embedding", "config": {"name": "FM_average_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 4384, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_rating", 0, 0, {}]]]}, {"name": "flatten_81", "class_name": "Flatten", "config": {"name": "flatten_81", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_userID", 0, 0, {}]]]}, {"name": "flatten_82", "class_name": "Flatten", "config": {"name": "flatten_82", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_users_mean_rating", 0, 0, {}]]]}, {"name": "flatten_83", "class_name": "Flatten", "config": {"name": "flatten_83", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_user_reviewcount", 0, 0, {}]]]}, {"name": "flatten_84", "class_name": "Flatten", "config": {"name": "flatten_84", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_locationId", 0, 0, {}]]]}, {"name": "flatten_85", "class_name": "Flatten", "config": {"name": "flatten_85", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_createdDate", 0, 0, {}]]]}, {"name": "flatten_86", "class_name": "Flatten", "config": {"name": "flatten_86", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_photonum", 0, 0, {}]]]}, {"name": "flatten_87", "class_name": "Flatten", "config": {"name": "flatten_87", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_fch", 0, 0, {}]]]}, {"name": "flatten_88", "class_name": "Flatten", "config": {"name": "flatten_88", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_category_l", 0, 0, {}]]]}, {"name": "flatten_89", "class_name": "Flatten", "config": {"name": "flatten_89", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_rated_count", 0, 0, {}]]]}, {"name": "flatten_90", "class_name": "Flatten", "config": {"name": "flatten_90", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_photonum", 0, 0, {}]]]}, {"name": "flatten_91", "class_name": "Flatten", "config": {"name": "flatten_91", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_rating", 0, 0, {}]]]}, {"name": "lambda_77", "class_name": "Lambda", "config": {"name": "lambda_77", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_81", 0, 0, {}]]]}, {"name": "lambda_78", "class_name": "Lambda", "config": {"name": "lambda_78", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_82", 0, 0, {}]]]}, {"name": "lambda_79", "class_name": "Lambda", "config": {"name": "lambda_79", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_83", 0, 0, {}]]]}, {"name": "lambda_80", "class_name": "Lambda", "config": {"name": "lambda_80", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_84", 0, 0, {}]]]}, {"name": "lambda_81", "class_name": "Lambda", "config": {"name": "lambda_81", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_85", 0, 0, {}]]]}, {"name": "lambda_82", "class_name": "Lambda", "config": {"name": "lambda_82", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_86", 0, 0, {}]]]}, {"name": "lambda_83", "class_name": "Lambda", "config": {"name": "lambda_83", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_87", 0, 0, {}]]]}, {"name": "lambda_84", "class_name": "Lambda", "config": {"name": "lambda_84", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_88", 0, 0, {}]]]}, {"name": "lambda_85", "class_name": "Lambda", "config": {"name": "lambda_85", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_89", 0, 0, {}]]]}, {"name": "lambda_86", "class_name": "Lambda", "config": {"name": "lambda_86", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_90", 0, 0, {}]]]}, {"name": "lambda_87", "class_name": "Lambda", "config": {"name": "lambda_87", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPogPGlweXRo\nb24taW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aCXRyYW5zX211bAEAAABzBAAAAAABEgE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_91", 0, 0, {}]]]}, {"name": "concatenate_15", "class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lambda_77", 0, 0, {}], ["lambda_78", 0, 0, {}], ["lambda_79", 0, 0, {}], ["lambda_80", 0, 0, {}], ["lambda_81", 0, 0, {}], ["lambda_82", 0, 0, {}], ["lambda_83", 0, 0, {}], ["lambda_84", 0, 0, {}], ["lambda_85", 0, 0, {}], ["lambda_86", 0, 0, {}], ["lambda_87", 0, 0, {}]]]}, {"name": "flatten_93", "class_name": "Flatten", "config": {"name": "flatten_93", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "layer0", "class_name": "Dense", "config": {"name": "layer0", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_93", 0, 0, {}]]]}, {"name": "lambda_88", "class_name": "Lambda", "config": {"name": "lambda_88", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAADQAAAAsAAABDAAAAc9IAAAB8AFwLfQF9An0DfQR9BX0GfQd9CH0JfQp9C3QAagF8\nAXwCZwJkAWQCjQJ9DHQAagF8DHwDZwJkAWQCjQJ9DHQAagF8DHwEZwJkAWQCjQJ9DHQAagF8DHwF\nZwJkAWQCjQJ9DHQAagF8DHwGZwJkAWQCjQJ9DHQAagF8DHwHZwJkAWQCjQJ9DHQAagF8DHwIZwJk\nAWQCjQJ9DHQAagF8DHwJZwJkAWQCjQJ9DHQAagF8DHwKZwJkAWQCjQJ9DHQAagF8DHwLZwJkAWQC\njQJ9DHwMUwApA07pAgAAACkB2gRheGlzKQLaAnRm2gZjb25jYXQpDdoFdmVjdHPaAmEx2gJhMtoC\nYTPaAmE02gJhNdoCYTbaAmE32gJhONoCYTnaA2ExMNoDYTEx2gF6qQByEgAAAPogPGlweXRob24t\naW5wdXQtNTY0LTAwMjgwMWI0ZjA5YT7aDmNvbmNhdF9zaGFwZTJEBQAAAHMYAAAAAAEaARIBEgES\nARIBEgESARIBEgESARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_77", 0, 0, {}], ["lambda_78", 0, 0, {}], ["lambda_79", 0, 0, {}], ["lambda_80", 0, 0, {}], ["lambda_81", 0, 0, {}], ["lambda_82", 0, 0, {}], ["lambda_83", 0, 0, {}], ["lambda_84", 0, 0, {}], ["lambda_85", 0, 0, {}], ["lambda_86", 0, 0, {}], ["lambda_87", 0, 0, {}]]]}, {"name": "layer1", "class_name": "Dense", "config": {"name": "layer1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer0", 0, 0, {}]]]}, {"name": "conv1d_5", "class_name": "Conv1D", "config": {"name": "conv1d_5", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_88", 0, 0, {}]]]}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_93", 0, 0, {}], ["layer1", 0, 0, {}]]]}, {"name": "flatten_92", "class_name": "Flatten", "config": {"name": "flatten_92", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]]}, {"name": "concatenate_17", "class_name": "Concatenate", "config": {"name": "concatenate_17", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_92", 0, 0, {}], ["dense_5", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]]}, {"name": "prediction", "class_name": "Dense", "config": {"name": "prediction", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}], "input_layers": [["userID", 0, 0], ["users_mean_rating", 0, 0], ["user_reviewcount", 0, 0], ["locationId", 0, 0], ["createdDate", 0, 0], ["photonum", 0, 0], ["fch", 0, 0], ["category_l", 0, 0], ["rated_count", 0, 0], ["average_photonum", 0, 0], ["average_rating", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}