{"class_name": "Model", "config": {"name": "model_56", "layers": [{"name": "userID", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "userID"}, "inbound_nodes": []}, {"name": "users_mean_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "users_mean_rating"}, "inbound_nodes": []}, {"name": "user_reviewcount", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "user_reviewcount"}, "inbound_nodes": []}, {"name": "locationId", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "locationId"}, "inbound_nodes": []}, {"name": "createdDate", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "createdDate"}, "inbound_nodes": []}, {"name": "photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "photonum"}, "inbound_nodes": []}, {"name": "fch", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "fch"}, "inbound_nodes": []}, {"name": "category_l", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "category_l"}, "inbound_nodes": []}, {"name": "rated_count", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "rated_count"}, "inbound_nodes": []}, {"name": "average_photonum", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_photonum"}, "inbound_nodes": []}, {"name": "average_rating", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "average_rating"}, "inbound_nodes": []}, {"name": "lw", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "int64", "sparse": false, "name": "lw"}, "inbound_nodes": []}, {"name": "FM_userID", "class_name": "Embedding", "config": {"name": "FM_userID", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 85413, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["userID", 0, 0, {}]]]}, {"name": "FM_users_mean_rating", "class_name": "Embedding", "config": {"name": "FM_users_mean_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 30961, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["users_mean_rating", 0, 0, {}]]]}, {"name": "FM_user_reviewcount", "class_name": "Embedding", "config": {"name": "FM_user_reviewcount", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 176, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["user_reviewcount", 0, 0, {}]]]}, {"name": "FM_locationId", "class_name": "Embedding", "config": {"name": "FM_locationId", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 5601, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["locationId", 0, 0, {}]]]}, {"name": "FM_createdDate", "class_name": "Embedding", "config": {"name": "FM_createdDate", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 4238, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["createdDate", 0, 0, {}]]]}, {"name": "FM_photonum", "class_name": "Embedding", "config": {"name": "FM_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 39, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["photonum", 0, 0, {}]]]}, {"name": "FM_fch", "class_name": "Embedding", "config": {"name": "FM_fch", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["fch", 0, 0, {}]]]}, {"name": "FM_category_l", "class_name": "Embedding", "config": {"name": "FM_category_l", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 2, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["category_l", 0, 0, {}]]]}, {"name": "FM_rated_count", "class_name": "Embedding", "config": {"name": "FM_rated_count", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 226, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["rated_count", 0, 0, {}]]]}, {"name": "FM_average_photonum", "class_name": "Embedding", "config": {"name": "FM_average_photonum", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1084, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_photonum", 0, 0, {}]]]}, {"name": "FM_average_rating", "class_name": "Embedding", "config": {"name": "FM_average_rating", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 1646, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["average_rating", 0, 0, {}]]]}, {"name": "FM_lw", "class_name": "Embedding", "config": {"name": "FM_lw", "trainable": true, "batch_input_shape": [null, 1], "dtype": "float32", "input_dim": 2, "output_dim": 8, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "inbound_nodes": [[["lw", 0, 0, {}]]]}, {"name": "flatten_289", "class_name": "Flatten", "config": {"name": "flatten_289", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_userID", 0, 0, {}]]]}, {"name": "flatten_290", "class_name": "Flatten", "config": {"name": "flatten_290", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_users_mean_rating", 0, 0, {}]]]}, {"name": "flatten_291", "class_name": "Flatten", "config": {"name": "flatten_291", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_user_reviewcount", 0, 0, {}]]]}, {"name": "flatten_292", "class_name": "Flatten", "config": {"name": "flatten_292", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_locationId", 0, 0, {}]]]}, {"name": "flatten_293", "class_name": "Flatten", "config": {"name": "flatten_293", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_createdDate", 0, 0, {}]]]}, {"name": "flatten_294", "class_name": "Flatten", "config": {"name": "flatten_294", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_photonum", 0, 0, {}]]]}, {"name": "flatten_295", "class_name": "Flatten", "config": {"name": "flatten_295", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_fch", 0, 0, {}]]]}, {"name": "flatten_296", "class_name": "Flatten", "config": {"name": "flatten_296", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_category_l", 0, 0, {}]]]}, {"name": "flatten_297", "class_name": "Flatten", "config": {"name": "flatten_297", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_rated_count", 0, 0, {}]]]}, {"name": "flatten_298", "class_name": "Flatten", "config": {"name": "flatten_298", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_photonum", 0, 0, {}]]]}, {"name": "flatten_299", "class_name": "Flatten", "config": {"name": "flatten_299", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_average_rating", 0, 0, {}]]]}, {"name": "flatten_300", "class_name": "Flatten", "config": {"name": "flatten_300", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["FM_lw", 0, 0, {}]]]}, {"name": "lambda_271", "class_name": "Lambda", "config": {"name": "lambda_271", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_289", 0, 0, {}]]]}, {"name": "lambda_272", "class_name": "Lambda", "config": {"name": "lambda_272", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_290", 0, 0, {}]]]}, {"name": "lambda_273", "class_name": "Lambda", "config": {"name": "lambda_273", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_291", 0, 0, {}]]]}, {"name": "lambda_274", "class_name": "Lambda", "config": {"name": "lambda_274", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_292", 0, 0, {}]]]}, {"name": "lambda_275", "class_name": "Lambda", "config": {"name": "lambda_275", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_293", 0, 0, {}]]]}, {"name": "lambda_276", "class_name": "Lambda", "config": {"name": "lambda_276", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_294", 0, 0, {}]]]}, {"name": "lambda_277", "class_name": "Lambda", "config": {"name": "lambda_277", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_295", 0, 0, {}]]]}, {"name": "lambda_278", "class_name": "Lambda", "config": {"name": "lambda_278", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_296", 0, 0, {}]]]}, {"name": "lambda_279", "class_name": "Lambda", "config": {"name": "lambda_279", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_297", 0, 0, {}]]]}, {"name": "lambda_280", "class_name": "Lambda", "config": {"name": "lambda_280", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_298", 0, 0, {}]]]}, {"name": "lambda_281", "class_name": "Lambda", "config": {"name": "lambda_281", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_299", 0, 0, {}]]]}, {"name": "lambda_282", "class_name": "Lambda", "config": {"name": "lambda_282", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAgAAAAYAAABDAAAAcxYAAAB0AKABfABkAXQCZAJmA6ECfQF8AVMAKQNO6f/////p\nAQAAACkD2gJ0ZtoHcmVzaGFwZdoJbl9mYWN0b3JzKQLaBXZlY3Rz2gF6qQByCAAAAPohPGlweXRo\nb24taW5wdXQtMTE4Ni0xNTRmOWIzZTJkNDg+2gl0cmFuc19tdWwBAAAAcwQAAAAAARIB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["flatten_300", 0, 0, {}]]]}, {"name": "concatenate_60", "class_name": "Concatenate", "config": {"name": "concatenate_60", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["lambda_271", 0, 0, {}], ["lambda_272", 0, 0, {}], ["lambda_273", 0, 0, {}], ["lambda_274", 0, 0, {}], ["lambda_275", 0, 0, {}], ["lambda_276", 0, 0, {}], ["lambda_277", 0, 0, {}], ["lambda_278", 0, 0, {}], ["lambda_279", 0, 0, {}], ["lambda_280", 0, 0, {}], ["lambda_281", 0, 0, {}], ["lambda_282", 0, 0, {}]]]}, {"name": "flatten_302", "class_name": "Flatten", "config": {"name": "flatten_302", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_60", 0, 0, {}]]]}, {"name": "layer0", "class_name": "Dense", "config": {"name": "layer0", "trainable": true, "dtype": "float32", "units": 16, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["flatten_302", 0, 0, {}]]]}, {"name": "lambda_283", "class_name": "Lambda", "config": {"name": "lambda_283", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAADgAAAAwAAABDAAAAc+YAAAB8AFwMfQF9An0DfQR9BX0GfQd9CH0JfQp9C30MdABq\nAXwBfAJnAmQBZAKNAn0NdABqAXwNfANnAmQBZAKNAn0NdABqAXwNfARnAmQBZAKNAn0NdABqAXwN\nfAVnAmQBZAKNAn0NdABqAXwNfAZnAmQBZAKNAn0NdABqAXwNfAdnAmQBZAKNAn0NdABqAXwNfAhn\nAmQBZAKNAn0NdABqAXwNfAlnAmQBZAKNAn0NdABqAXwNfApnAmQBZAKNAn0NdABqAXwNfAtnAmQB\nZAKNAn0NdABqAXwNfAxnAmQBZAKNAn0NfA1TACkDTukCAAAAKQHaBGF4aXMpAtoCdGbaBmNvbmNh\ndCkO2gV2ZWN0c9oCYTHaAmEy2gJhM9oCYTTaAmE12gJhNtoCYTfaAmE42gJhOdoDYTEw2gNhMTHa\nA2ExMtoBeqkAchMAAAD6ITxpcHl0aG9uLWlucHV0LTExODYtMTU0ZjliM2UyZDQ4PtoOY29uY2F0\nX3NoYXBlMkQFAAAAcxoAAAAAARwBEgESARIBEgESARIBEgESARIBEgESAQ==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_271", 0, 0, {}], ["lambda_272", 0, 0, {}], ["lambda_273", 0, 0, {}], ["lambda_274", 0, 0, {}], ["lambda_275", 0, 0, {}], ["lambda_276", 0, 0, {}], ["lambda_277", 0, 0, {}], ["lambda_278", 0, 0, {}], ["lambda_279", 0, 0, {}], ["lambda_280", 0, 0, {}], ["lambda_281", 0, 0, {}], ["lambda_282", 0, 0, {}]]]}, {"name": "layer1", "class_name": "Dense", "config": {"name": "layer1", "trainable": true, "dtype": "float32", "units": 8, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["layer0", 0, 0, {}]]]}, {"name": "conv1d_20", "class_name": "Conv1D", "config": {"name": "conv1d_20", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["lambda_283", 0, 0, {}]]]}, {"name": "concatenate_61", "class_name": "Concatenate", "config": {"name": "concatenate_61", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_302", 0, 0, {}], ["layer1", 0, 0, {}]]]}, {"name": "flatten_301", "class_name": "Flatten", "config": {"name": "flatten_301", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]]}, {"name": "dense_20", "class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 4, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_61", 0, 0, {}]]]}, {"name": "concatenate_62", "class_name": "Concatenate", "config": {"name": "concatenate_62", "trainable": true, "dtype": "float32", "axis": -1}, "inbound_nodes": [[["flatten_301", 0, 0, {}], ["dense_20", 0, 0, {}]]]}, {"name": "dropout_22", "class_name": "Dropout", "config": {"name": "dropout_22", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["concatenate_62", 0, 0, {}]]]}, {"name": "prediction", "class_name": "Dense", "config": {"name": "prediction", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_22", 0, 0, {}]]]}], "input_layers": [["userID", 0, 0], ["users_mean_rating", 0, 0], ["user_reviewcount", 0, 0], ["locationId", 0, 0], ["createdDate", 0, 0], ["photonum", 0, 0], ["fch", 0, 0], ["category_l", 0, 0], ["rated_count", 0, 0], ["average_photonum", 0, 0], ["average_rating", 0, 0], ["lw", 0, 0]], "output_layers": [["prediction", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}